export const details = [
  {
    image:
      'https://telegram.org/file/464001838/1/GDPE_UE4KFY.77587/f3ebf15475f5ac1f66',
    data: [
      {
        type: 'paragraph',
        value: [
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
        ],
      },
      {
        type: 'ordered-list',
        value: [
          'Lorem ipsum dolor sit amet, consectetur adipisicing elit',
          'Assumenda, quia temporibus eveniet a libero incidunt suscipit',
          'Quidem, ipsam illum quis sed voluptatum quae eum fugit earum',
          'Quidem, ipsam illum quis sed voluptatum quae eum fugit earum',
        ],
      },
      {
        type: 'paragraph',
        value: [
          'После чего, создатели Vestel начинают выкупать монету, делают это плавно и постепенно, чтобы цена сразу не улетела вверх.',
          'Параллельно с этим в разных социальных сетях начинает выпускать заранее купленная реклама, про саму монету. Якобы рост, который она сейчас демонстрирует, чем-то обусловлен. После маркетинговой поддержки, актив начинают качать сильнее, вызывая быстрый рос. Видя новости, который подтверждаются ростов монеты в реальном времени, люди начинают скупать монету, а продают ее именно памперы, которые купили ее заранее, по более выгодной цене. Это краткое описание всего процесса работы, если вам интересно, более подробно можно почитать об этом в гугле.',
        ],
      },
      { type: 'title', value: 'What we write about' },
      {
        type: 'list',
        value: [
          '«Pump Dump». Новички, которые впервые сталкиваются со стратегией пампов, могут познакомиться с ее деталями и историей возникновения.',
          '«Наш робот». Описание и алгоритм работы программы.',
          '«Участие в пампе». В меню можно ознакомиться с условиями сотрудничества с проектом.',
          '«Задать вопрос». Если у пользователя еще останутся вопросы, он сможет их задать в личной переписке с администратором проекта.',
        ],
      },
      {
        type: 'paragraph',
        value: [
          'Поучаствовать в пампе может любой желающий. Сама работа происходит по депозитной системе, что учитывая важную составляющую софта вполне логично. Руками такое провернуть практически невозможно. Инвесторам предлагается четыре уровня сотрудничества. Их условия и прибыльность зависит от уровня.',
        ],
      },
      {
        type: 'list',
        value: [
          '1 уровень, депозит 4000, прибыль 7000 рублей.',
          '2 уровень, депозит 11000, прибыль 24000 рублей.',
          '3 уровень, депозит 27000, прибыль 70000 рублей.',
          '4 уровень, депозит 45000, прибыль 150000 рублей.',
        ],
      },
    ],
  },
  {
    image:
      'https://telegram.org/file/464001806/2/ZdTEg4owdeU.196621/6b3f6ba6826440ae99',
    data: [
      {
        type: 'paragraph',
        value: [
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
        ],
      },
      {
        type: 'ordered-list',
        value: [
          'Lorem ipsum dolor sit amet, consectetur adipisicing elit',
          'Assumenda, quia temporibus eveniet a libero incidunt suscipit',
          'Quidem, ipsam illum quis sed voluptatum quae eum fugit earum',
          'Quidem, ipsam illum quis sed voluptatum quae eum fugit earum',
        ],
      },
      {
        type: 'paragraph',
        value: [
          'После чего, создатели Vestel начинают выкупать монету, делают это плавно и постепенно, чтобы цена сразу не улетела вверх.',
          'Параллельно с этим в разных социальных сетях начинает выпускать заранее купленная реклама, про саму монету. Якобы рост, который она сейчас демонстрирует, чем-то обусловлен. После маркетинговой поддержки, актив начинают качать сильнее, вызывая быстрый рос. Видя новости, который подтверждаются ростов монеты в реальном времени, люди начинают скупать монету, а продают ее именно памперы, которые купили ее заранее, по более выгодной цене. Это краткое описание всего процесса работы, если вам интересно, более подробно можно почитать об этом в гугле.',
        ],
      },
      { type: 'title', value: 'What we write about' },
      {
        type: 'list',
        value: [
          '«Pump Dump». Новички, которые впервые сталкиваются со стратегией пампов, могут познакомиться с ее деталями и историей возникновения.',
          '«Наш робот». Описание и алгоритм работы программы.',
          '«Участие в пампе». В меню можно ознакомиться с условиями сотрудничества с проектом.',
          '«Задать вопрос». Если у пользователя еще останутся вопросы, он сможет их задать в личной переписке с администратором проекта.',
        ],
      },
      {
        type: 'paragraph',
        value: [
          'Поучаствовать в пампе может любой желающий. Сама работа происходит по депозитной системе, что учитывая важную составляющую софта вполне логично. Руками такое провернуть практически невозможно. Инвесторам предлагается четыре уровня сотрудничества. Их условия и прибыльность зависит от уровня.',
        ],
      },
      {
        type: 'list',
        value: [
          '1 уровень, депозит 4000, прибыль 7000 рублей.',
          '2 уровень, депозит 11000, прибыль 24000 рублей.',
          '3 уровень, депозит 27000, прибыль 70000 рублей.',
          '4 уровень, депозит 45000, прибыль 150000 рублей.',
        ],
      },
    ],
  },
  {
    image:
      'https://telegram.org/file/464001724/1/Z0DVgBP2R1o.77883/c12a015393d6f7c25a',
    data: [
      {
        type: 'paragraph',
        value: [
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
        ],
      },
      {
        type: 'ordered-list',
        value: [
          'Lorem ipsum dolor sit amet, consectetur adipisicing elit',
          'Assumenda, quia temporibus eveniet a libero incidunt suscipit',
          'Quidem, ipsam illum quis sed voluptatum quae eum fugit earum',
          'Quidem, ipsam illum quis sed voluptatum quae eum fugit earum',
        ],
      },
      {
        type: 'paragraph',
        value: [
          'После чего, создатели Vestel начинают выкупать монету, делают это плавно и постепенно, чтобы цена сразу не улетела вверх.',
          'Параллельно с этим в разных социальных сетях начинает выпускать заранее купленная реклама, про саму монету. Якобы рост, который она сейчас демонстрирует, чем-то обусловлен. После маркетинговой поддержки, актив начинают качать сильнее, вызывая быстрый рос. Видя новости, который подтверждаются ростов монеты в реальном времени, люди начинают скупать монету, а продают ее именно памперы, которые купили ее заранее, по более выгодной цене. Это краткое описание всего процесса работы, если вам интересно, более подробно можно почитать об этом в гугле.',
        ],
      },
      { type: 'title', value: 'What we write about' },
      {
        type: 'list',
        value: [
          '«Pump Dump». Новички, которые впервые сталкиваются со стратегией пампов, могут познакомиться с ее деталями и историей возникновения.',
          '«Наш робот». Описание и алгоритм работы программы.',
          '«Участие в пампе». В меню можно ознакомиться с условиями сотрудничества с проектом.',
          '«Задать вопрос». Если у пользователя еще останутся вопросы, он сможет их задать в личной переписке с администратором проекта.',
        ],
      },
      {
        type: 'paragraph',
        value: [
          'Поучаствовать в пампе может любой желающий. Сама работа происходит по депозитной системе, что учитывая важную составляющую софта вполне логично. Руками такое провернуть практически невозможно. Инвесторам предлагается четыре уровня сотрудничества. Их условия и прибыльность зависит от уровня.',
        ],
      },
      {
        type: 'list',
        value: [
          '1 уровень, депозит 4000, прибыль 7000 рублей.',
          '2 уровень, депозит 11000, прибыль 24000 рублей.',
          '3 уровень, депозит 27000, прибыль 70000 рублей.',
          '4 уровень, депозит 45000, прибыль 150000 рублей.',
        ],
      },
    ],
  },
  {
    image:
      'https://telegram.org/file/464001013/3/M4ILSoHVnTs.73147/9e62d5b6a045843831',
    data: [
      {
        type: 'paragraph',
        value: [
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
        ],
      },
      {
        type: 'ordered-list',
        value: [
          'Lorem ipsum dolor sit amet, consectetur adipisicing elit',
          'Assumenda, quia temporibus eveniet a libero incidunt suscipit',
          'Quidem, ipsam illum quis sed voluptatum quae eum fugit earum',
          'Quidem, ipsam illum quis sed voluptatum quae eum fugit earum',
        ],
      },
      {
        type: 'paragraph',
        value: [
          'После чего, создатели Vestel начинают выкупать монету, делают это плавно и постепенно, чтобы цена сразу не улетела вверх.',
          'Параллельно с этим в разных социальных сетях начинает выпускать заранее купленная реклама, про саму монету. Якобы рост, который она сейчас демонстрирует, чем-то обусловлен. После маркетинговой поддержки, актив начинают качать сильнее, вызывая быстрый рос. Видя новости, который подтверждаются ростов монеты в реальном времени, люди начинают скупать монету, а продают ее именно памперы, которые купили ее заранее, по более выгодной цене. Это краткое описание всего процесса работы, если вам интересно, более подробно можно почитать об этом в гугле.',
        ],
      },
      { type: 'title', value: 'What we write about' },
      {
        type: 'list',
        value: [
          '«Pump Dump». Новички, которые впервые сталкиваются со стратегией пампов, могут познакомиться с ее деталями и историей возникновения.',
          '«Наш робот». Описание и алгоритм работы программы.',
          '«Участие в пампе». В меню можно ознакомиться с условиями сотрудничества с проектом.',
          '«Задать вопрос». Если у пользователя еще останутся вопросы, он сможет их задать в личной переписке с администратором проекта.',
        ],
      },
      {
        type: 'paragraph',
        value: [
          'Поучаствовать в пампе может любой желающий. Сама работа происходит по депозитной системе, что учитывая важную составляющую софта вполне логично. Руками такое провернуть практически невозможно. Инвесторам предлагается четыре уровня сотрудничества. Их условия и прибыльность зависит от уровня.',
        ],
      },
      {
        type: 'list',
        value: [
          '1 уровень, депозит 4000, прибыль 7000 рублей.',
          '2 уровень, депозит 11000, прибыль 24000 рублей.',
          '3 уровень, депозит 27000, прибыль 70000 рублей.',
          '4 уровень, депозит 45000, прибыль 150000 рублей.',
        ],
      },
    ],
  },
  {
    image:
      'https://telegram.org/file/464001736/5/ipfhG9klnEY.104527/e04b526a7d02d8b541',
    data: [
      {
        type: 'paragraph',
        value: [
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
        ],
      },
      {
        type: 'ordered-list',
        value: [
          'Lorem ipsum dolor sit amet, consectetur adipisicing elit',
          'Assumenda, quia temporibus eveniet a libero incidunt suscipit',
          'Quidem, ipsam illum quis sed voluptatum quae eum fugit earum',
          'Quidem, ipsam illum quis sed voluptatum quae eum fugit earum',
        ],
      },
      {
        type: 'paragraph',
        value: [
          'После чего, создатели Vestel начинают выкупать монету, делают это плавно и постепенно, чтобы цена сразу не улетела вверх.',
          'Параллельно с этим в разных социальных сетях начинает выпускать заранее купленная реклама, про саму монету. Якобы рост, который она сейчас демонстрирует, чем-то обусловлен. После маркетинговой поддержки, актив начинают качать сильнее, вызывая быстрый рос. Видя новости, который подтверждаются ростов монеты в реальном времени, люди начинают скупать монету, а продают ее именно памперы, которые купили ее заранее, по более выгодной цене. Это краткое описание всего процесса работы, если вам интересно, более подробно можно почитать об этом в гугле.',
        ],
      },
      { type: 'title', value: 'What we write about' },
      {
        type: 'list',
        value: [
          '«Pump Dump». Новички, которые впервые сталкиваются со стратегией пампов, могут познакомиться с ее деталями и историей возникновения.',
          '«Наш робот». Описание и алгоритм работы программы.',
          '«Участие в пампе». В меню можно ознакомиться с условиями сотрудничества с проектом.',
          '«Задать вопрос». Если у пользователя еще останутся вопросы, он сможет их задать в личной переписке с администратором проекта.',
        ],
      },
      {
        type: 'paragraph',
        value: [
          'Поучаствовать в пампе может любой желающий. Сама работа происходит по депозитной системе, что учитывая важную составляющую софта вполне логично. Руками такое провернуть практически невозможно. Инвесторам предлагается четыре уровня сотрудничества. Их условия и прибыльность зависит от уровня.',
        ],
      },
      {
        type: 'list',
        value: [
          '1 уровень, депозит 4000, прибыль 7000 рублей.',
          '2 уровень, депозит 11000, прибыль 24000 рублей.',
          '3 уровень, депозит 27000, прибыль 70000 рублей.',
          '4 уровень, депозит 45000, прибыль 150000 рублей.',
        ],
      },
    ],
  },
];
