export const details = [
  {
    image:
      'https://telegram.org/file/464001838/1/GDPE_UE4KFY.77587/f3ebf15475f5ac1f66',
    data: [
      {
        type: 'paragraph',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
      {
        type: 'ordered-list',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
      {
        type: 'paragraph',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
      { type: 'title', value: 'What we write about' },
      {
        type: 'list',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
      {
        type: 'paragraph',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
      {
        type: 'list',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
    ],
  },
  {
    image:
      'https://telegram.org/file/464001806/2/ZdTEg4owdeU.196621/6b3f6ba6826440ae99',
    data: [
      {
        type: 'paragraph',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
      {
        type: 'ordered-list',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
      {
        type: 'paragraph',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
      { type: 'title', value: 'What we write about' },
      {
        type: 'list',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
      {
        type: 'paragraph',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
      {
        type: 'list',
        value:
          'Vestel — бот в мессенджере Telegram, проект посвящен заработку с использования стратегии Pump&Dump. Как пользоваться Vestel и какие функции в нем доступны, расскажем в нашем обзоре. Разработкой занималась команда трейдеров, которые специализируются на пампах. Как утверждают разработчики проекта Вестел, большинство пампов длятся от 10 минут до нескольких часов. В столь небольших промежутках можно успеть заработать только при наличии автоматизированной программы. Именно такой софт и разработали создали проекта. Алгоритм действий проекта максимально простой:',
      },
    ],
  },
];
