export const gallery = [
  {
    title: 'Самые выгодные проекты для инвестирования',
    text: 'Надежные инвестиции в интернете имеют ряд преимуществ и недостатков.',
    image:
      'https://bens.org/wp-content/uploads/2021/12/office-buildings-1400x934.jpg',
  },
  {
    title: 'Прибыльные и надежные каналы в телеграмме про инвестиции',
    text: 'акие первые шаги новичка в инвестировании в 2023',
    image:
      'https://s40424.pcdn.co/in/wp-content/uploads/2022/06/business-finance.jpg',
  },
  {
    title: 'Проверенные инвестиции для вложений с ежедневной выплатой',
    text: 'Чтобы ваши деньги успешно работали, нужно не просто найти лучшие сайты для инвестиций, но и избегать распространенных ошибок, которые допускают новички.',
    image:
      'https://cdn.pixabay.com/photo/2020/05/12/20/01/bitcoin-5164786_1280.jpg',
  },
];
